In [1]:
import sqlite3 as sql
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#connection
conn = sql.connect('database1.sqlite')
conn

In [3]:
# conn = sql.connect('data.sqlite')
# conn

In [4]:
pd.read_sql_query("select * from Salaries", conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [5]:
def sql_query(q):
    return pd.read_sql_query(q,conn)

In [ ]:
# sub query cases

#Employees with TotalPay greater than the average TotalPay

q = '''SELECT EmployeeName, JobTitle, TotalPay
FROM salaries
WHERE TotalPay > (
    SELECT AVG(TotalPay)
    FROM salaries)'''

sql_query(q)

In [ ]:
q = '''SELECT EmployeeName, JobTitle, TotalPay
FROM salaries
WHERE TotalPay > AVG(TotalPay)
'''

sql_query(q)

In [ ]:
# sub query cases

#Employees with TotalPay greater than the average TotalPay

q = '''select employeename, totalpay from salaries
    where totalpay > (select avg(totalpay) from salaries)'''

sql_query(q)

In [ ]:
# sub query cases

#jobtitle with (baspay + otherpay) less than the average TotalPay

q = '''select jobtitle, basepay + otherpay from salaries
    where totalpay < (select avg(totalpay) from salaries)'''

sql_query(q)

### in

In [ ]:
q = '''select employeename, jobtitle from salaries
    where jobtitle in ('WATERSHED KEEPER' , 'Counselor, Log Cabin Ranch')'''

sql_query(q)

In [ ]:
q = '''select employeename, jobtitle from salaries
    where jobtitle = 'WATERSHED KEEPER'
    or
    jobtitle = 'Counselor, Log Cabin Ranch'
    '''

sql_query(q)

### like/glob

In [ ]:
q = '''select jobtitle from salaries where jobtitle like '%captain%'
'''

sql_query(q)

In [ ]:
q = '''select jobtitle from salaries where jobtitle like '%captain'
'''

sql_query(q)

In [ ]:
q = '''select jobtitle from salaries where jobtitle like 'captain%'
'''

sql_query(q)

In [ ]:
SELECT * FROM users WHERE name LIKE 'J%';  -- Finds all names starting with 'J'
SELECT * FROM users WHERE name GLOB 'J*';  -- Finds all names starting with 'J' (case-sensitive)

### case

- Categorizing Employees Based on overtimepay
- Categorizing Employees Based on BasePay
- Categorizing Job Titles Based on Pay

In [ ]:
q = '''select employeename, jobtitle, totalpay,
    case
        when overtimepay > 100000 then 'overtime worker'
        else 'regular worker'
    end as workcategory
from salaries'''

sql_query(q)

In [ ]:
q = '''select employeename, jobtitle, basepay,
    case
        when basepay > 100000 then 'high paying job'
        when basepay between 50000 and 99999 then 'medium paying job'
        else 'low paying job'
    end as jobcategory
from salaries'''

sql_query(q)

In [ ]:
q = '''insert into salaries (id
values

In [ ]:
q = '''update salaries
    set jobtitle = 'abc' , basepay = 1111
    where employeename = 'NATHANIEL FORD'
'''

conn.execute(q)

In [ ]:
q = '''select * from salaries'''

sql_query(q)

In [ ]:
q = '''delete from salaries where employeename = 'NATHANIEL FORD'
'''

conn.execute(q)

In [ ]:
q = '''select * from salaries'''

sql_query(q)

In [ ]:
#functions

#string functions
#numeric FUNCTIONS

### UPDATE

### INSERT

### DELETE

### String Function

#### upper/lower

In [ ]:
q='''SELECT lower(EmployeeName) FROM salaries'''

sql_query(q)

In [ ]:
### trim. rtrim, ltrim

In [10]:
q='''SELECT lTRIM(Notes) FROM salaries'''

sql_query(q)

       lTRIM(Notes)
0
1
2
3
4
...             ...
148649
148650
148651
148652
148653

[148654 rows x 1 columns]

In [7]:
q='''SELECT REPLACE(Jobtitle, 'Not provided', 'N/A') FROM salaries'''

sql_query(q)

              REPLACE(Jobtitle, 'Not provided', 'N/A')
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                      CAPTAIN III (POLICE DEPARTMENT)
2                      CAPTAIN III (POLICE DEPARTMENT)
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
...                                                ...
148649                                       Custodian
148650                                             N/A
148651                                             N/A
148652                                             N/A
148653                      Counselor, Log Cabin Ranch

[148654 rows x 1 columns]

In [ ]:
sql_query(q)

In [ ]:
q='''SELECT LENGTH(EmployeeName) FROM salaries
'''
sql_query(q)

### SUBSTR

### Numeric Function

#### Round

### ABS

#### CAST

#### MOD